const fs = require("fs");
const path = require('path');
const fileURL = require("./conf");
const list = [
    "2022 11 30 17 41 45驶向终极の火车之家！所谓改造，掌控设计的人才能逆转未来！",
    "2022 11 11 14 15 42天赋可不会带给你闪电般的洞察力！地才设计师爆改机车店！",
    "2022 10 31 14 53 54日本迷惑住宅鉴赏！脑洞大开の家！你搁着卡BUG呢？",
    "2022 10 22 20 11 36会被门暗杀の家！没有安全谈何安居？一级建筑师出动！ #旧房改造",
    "2022 10 09 18 44 13重铸荣光の家！夺回那间百年日式豪宅！2300万豪华爆改！",
    "2022 10 03 16 51 56日本小两口贷款3000万盖房！设计师奉上电锯之家！",
    "2022 09 17 13 52 33脑干缺失の家！所有居住痛点全收集！日本设计师面临最大危机！",
    "2022 09 14 13 32 59日本夫妇投资5000万为孩子建造游乐场之家！佛祖会原谅他们嘛？",
    "2022 09 09 18 00 00美军基地旁の家！6口人住6坪米？日本设计师诠释改造的真正意义！",
    "2022 09 08 15 13 35给房子加装空气悬挂！耐震性拉满的家！日本设计师惊天爆改！ #老房改造 #旧房改造 #家居设计 #小户型设计",
    "2022 08 21 15 48 37寿司之神眷顾の家！顶级木材全加持！改造故事？改造神话！",
    "2022 08 13 16 59 44爆改返老还童の家！纵向动线是毁灭也是重生！只有这个办法了！ #老房改造 #旧房改造 #家装装修 #设计",
    "2022 07 20 19 21 06史上最暴力增建！一室一厅强行变二室二厅？你搁着变形金刚呢？",
    "2022 07 08 15 07 51什么？8坪地皮四人住？直接十层最伟大魔塔之家！",
    "2022 07 02 16 17 50日本上世纪の外星建筑，似乎传承着某种古老意志！这能住人？",
    "2022 06 22 20 00 32被海神眷顾の家！全屋做旧处理爆改！救赎之道，就在其中！",
    "2022 06 17 19 22 20被豪雪淹没の家！火属性建筑师降临！将居住痛点燃烧殆尽！",
    "2022 06 08 16 49 49爆改！被嫌弃の建筑一生！能重回阳间就算成功！",
    "2022 05 20 15 28 00人与兽并存の家！怎样才算跨越物种的室内设计？答案就在这了！",
    "2022 03 15 17 23 55修复日本100年屋龄古宅！顶级建筑师的写意设计！",
    "2022 03 13 17 59 26四分五裂的家！注满日式元素！连酸奶都是建材捏！ #解说 #旧房改造 #室内设计 #装修 #家居 #故事",
    "2022 03 05 10 07 00落叶归根の家！非一建神级宝刀未老！奇迹继续上演！",
    "2022 02 16 14 23 29对神话中的住宅进行改造！集结百人之力！修复百年古宅！",
    "2022 01 28 18 05 13慕了！赛车手の梦中情房！把直列六缸塞入家中！",
    "2022 01 16 16 54 57日本夫妇为艺术献祭！建筑师闪现进场！亲手建造祭坛の家！",
    "2021 12 08 20 47 31求证阿基米德定律の家！日本母子豪掷1400万爆改老房！ #建筑设计 #老房改造 #旧房改造 #装修 #家居",
    "2021 11 24 10 24 28你为什么亵渎神作？深度洗白文解析132万翻车改造！",
    "2021 11 02 16 37 53有病患的家如何改造？完全无障碍！日本一级建筑师神作案例！",
    "2021 10 09 18 21 52似曾相识の家！巨型走廊面积如何利用？2000万打造日式夜光别墅！",
    "2021 10 02 17 29 49睡觉无法翻身の家！拒绝断舍离！1200万爆改央美高材生水墨世界！",
    "2021 10 01 19 15 34六梯之家！出嫁是唯一解脱？国服顶级建筑师27万爆改水箱之家！",
    "2021 04 27 19 19 36被自行车包围住の家！最具争议改造！900万爆改20平米超小户型！",
    "2021 04 24 13 14 22楼梯在壁橱里の家！日本最强建筑师参上！1000万疯狂改造老房！",
    "2021 04 19 22 05 07荒野求生の家！煎饼果子奶奶经营了40年的饭店，竟被改造成豪宅？",
    "2021 04 11 19 41 42一半都是厨房の家！史上最大厨房？单亲妈妈豪掷900万爆改咖啡厅",
    "2021 04 08 10 20 05年轻人第一套婚房竟是工地宿舍？校园情侣取出全部积蓄爆改婚房！",
    "2021 04 04 07 23 28阿尔茨海默症老人遗忘的家！细节拉满！上海夫妇二十万温情改造！ #改造  #梦想改造家  #室内设计  #装修",
    "2021 04 02 21 33 11日本百年古宅化身火车强行挪动？铃木家族豪掷2500万爆改老房！",
    "2021 03 29 21 13 1140人共用40平米？爆改让美女经纪人苦不堪言的橄榄球队更衣室！",
    "2021 03 27 01 13 24让新娘翘首以盼の家！史上最甜改造甜到掉牙！三万人民币的新房？",
    "2021 03 24 22 55 34如同原始部落の家！海岛大改造！岛民夫妇豪掷1300万日元爆改！",
    "2021 03 20 20 36 51失乐の幼儿园！废物利用做到极致的改造！给我四百万，还你游乐场 #旧房改造",
    "2021 03 17 12 21 00巴黎改造，一辈子住在船里的家！仿佛是另一个世界！六万欧元爆改",
    "2021 03 16 19 51 29巴黎改造！前所未有の大挑战！法国夫妻6万欧元爆改百年老房！",
    "2021 03 04 19 56 19冰冷的大学食堂让大学生苦不堪言，校长怒掷3000万日元大改造！",
    "客廳裝修，到底有多內卷？#裝修#裝修設計#內卷",
    "假如衛生間能重裝，我會這樣做！視頻教程，準備裝修的朋友，請耐心看完，或許會有一點用！#裝修#衛生間#",
    "假如設計師是你家親戚！真正的裝修避坑指南！",
    "抖音健身總教練劉畊宏，劉教練家的客廳還不够健身氛圍，看我如何改造！",
    "廚房隔牆一定要拆掉，拆完空間大一倍！"
]
const readDir = fs.readdirSync(fileURL);
console.log('readDir',readDir[1])
for (let i = 0; i < readDir.length; i++) {
    for (let j = 0; j < list.length; j++) {
        if (readDir[i].includes(list[j])) {
            list.splice(j, 1)
            let sourceFile = path.join(__dirname, readDir[i]);
            let destPath = path.join(__dirname, "版权主张", readDir[i]);
            fs.rename(sourceFile, destPath,
                function(err) {
                    if (err) throw err;
                    fs.stat(destPath,
                        function(err, stats) {
                            if (err) throw err;
                            console.log('stats: ' + JSON.stringify(stats));
                        });
                });
        }
    }
}